[
    {
        "text": " Привет! В этом видео я протестировал 6 продуктов, которые называют себя AI Software Engineer или искусственный интеллект, который предваряется программистом. Для начала следует рассказать",
        "start_time": 0,
        "end_time": 12
    },
    {
        "text": " Для начала следует рассказать, что эти продукты себя представляют. А эти продукты себя представляют так или иначе интерфейска, какой-то нейроситий, которая предлагает трансформировать вашим",
        "start_time": 10,
        "end_time": 22
    },
    {
        "text": " предлагает трансформировать вашего вот на естественном человеческом языке, собственно, в программный продукт. И делают они обычно это все по одному и там уже сценарию, то есть вы им пишите какой-то вот они из этого",
        "start_time": 20,
        "end_time": 32
    },
    {
        "text": " пишите какой-то вот, они из этого вода делают какой-то план, потом начинают над этим планом работать. Иногда они еще предлагают вам как бы проверить этот план как-то его изменить, под корректировать что-то добавить. В общем,",
        "start_time": 30,
        "end_time": 42
    },
    {
        "text": " что-то добавить, в общем, отдают вам контроль на этом этапе работы. Эти продукты имеют различные интерфейс в заимодействия с ними, и на мой взгляд это была наиболее интересная часть исследования, потому",
        "start_time": 40,
        "end_time": 52
    },
    {
        "text": " более интересная часть исследования, потому что мне кажется вот где-то там, оно и будет развиваться, то есть какой-то из этих интерфейсов в итоге станет каноническим, но об этом я расскажу чуть позже.",
        "start_time": 50,
        "end_time": 62
    },
    {
        "text": " Но об этом я расскажу чуть позже. Также я понимаю, что вы видели наверняка уже сотню подобных видео, но во всех этих подобных видео обычно и во всех этих рекламных видео в частности, например.",
        "start_time": 60,
        "end_time": 72
    },
    {
        "text": " в частности, например, видео-сервиса-рэплет.com, где я, собственно, директор этого сервиса показывает, как он здорово с помощью своего агента этого",
        "start_time": 70,
        "end_time": 82
    },
    {
        "text": " с помощью своего агента, этого агента я тоже протестировал, как он здорово делает карту достопримечательности в той локации, где он есть. Так вот, что кофтом, что все эти видео обычно формирует.",
        "start_time": 80,
        "end_time": 92
    },
    {
        "text": " все эти видео. Обычно фокусируется на вокруг какой-то очень маленькой и односложно и задачи. Вот это мне кажется очень важный момент, что задача, односложенное. Обычно просит сделать какой-то сильный",
        "start_time": 90,
        "end_time": 102
    },
    {
        "text": " обычно просит сделать какой-то сервис, вот я видел, что календарь либо какой-то вот такой вот веб-сайт, который собственно показывает достопримечает инстекарту рисует где-то и еще что-то маленькое.",
        "start_time": 100,
        "end_time": 112
    }
]